src/toir_cfe/src/Documents/проф_ЗаказНаПеремещение/проф_ЗаказНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6d176df8-68cb-4f19-bbac-bbd7703c2c98">
  <name>проф_ЗаказНаПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6c5a2bf9-d2aa-47e8-8705-6694bb13f700">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9721a458-7ec1-44ec-b1af-2b95e3a8f96b">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e16088c3-7946-48c6-b8f1-834edcf811f9">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f1feb67-7ecb-4ca1-a7ed-bd5a21a1e55f">
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a3eb8ed-6505-4b50-a4a8-5c417d8155fd">
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dee0b4b7-6273-4197-8770-a6fd0a284944">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="802fc0c1-1d67-46b2-b600-20fd67929d69">
    <name>МаксимальныйКодСтроки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fe487b2-2316-49ec-9feb-962a7e047234">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e73a67b0-2dd9-4207-b564-102ae95fa235">
    <name>НазначениеИсходное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7a1cafeb-fbf9-4c85-8a92-639d81876de2">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="638c5eb2-28f6-4e8c-8256-18545853e218">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5e6ad81e-c158-45e1-b2c4-150f6e93ad45">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55d934b3-78a3-44db-a79c-9bd1a458407d">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ba9f6e5-e9ce-4ddc-bac2-38b3198f0154">
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7cb73df8-dd58-4cb2-8829-aa6b5946a811">
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b89ac4b9-aad4-442d-aad4-9ec9e2561e60">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c858b012-0671-4314-992f-cba64c579dd3">
    <name>СтатусСогласованияЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22b05a24-50ae-4294-91fc-f1acdf0e92bb">
    <name>торо_IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0734cf74-4ced-4a5d-a431-b1a5e3c69771">
    <name>торо_ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="72220f49-3577-4831-855b-459df2fcb09c">
    <name>торо_СозданПоПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d6f212f0-6417-4b99-aca2-7b8ca7faa450">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9c485d5b-b30d-4a52-ad19-a6c9f54b1f4a">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c8a6a1e-19df-4b95-a737-3f063f5ebd2c">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fdaba214-9037-48dd-a0eb-c0094d26c186">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="332d8232-8607-4b2a-9dda-ab29ff17a347">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4124bbfc-5dd6-421d-9aea-64892a2a14d4">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd73183c-12b8-47c1-aa41-5a5da0a13446">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ae21b88d-d09e-4332-9f7d-1a922d046cfa">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="200dffe7-979b-48e8-83b3-878b24cc4b3c">
      <name>Доступно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="435a0603-32c2-440e-bf7f-41971b029775">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cedbcd25-052b-4e57-9ffa-720ed25cfe45">
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4b9eaa58-e03a-4ef7-b478-090673f0bbe1">
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6312e8e6-a80c-466a-a193-8855e54441b6">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c192348f-8f44-4fa3-b558-83c2ea72d129">
      <name>НазначениеИсходное</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3e80edae-4125-4ec6-b4f2-81bef4580370">
      <name>СогласованиеКорректировки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8db1f0d2-ece7-4d77-9d72-a1e7cd68795f">
      <name>ТекстОшибки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60b619ed-751e-42e9-9466-5dc0c6505920">
      <name>Отменил</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Enums/торо_СтатусыУтвержденияЗаказовНаВП/торо_СтатусыУтвержденияЗаказовНаВП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="db5b1609-65ac-42cf-9053-e0b79f8ef87b">
  <name>торо_СтатусыУтвержденияЗаказовНаВП</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57e30e6c-f60b-42d5-8b2c-4c2b5007c40c">
    <name>проф_Новый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7612b309-90e1-40b9-93d9-2a11e7f96bbf">
    <name>НаУтверждении</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="24711251-eb0c-4d8e-9fc2-dec1853a6bc5">
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="705e506d-db5a-4184-9ca1-dec5c3ff5d62">
    <name>НеИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15c1cae0-77b2-42e1-a9de-a4c4f175befc">
    <name>ОбщиеДляВидаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f51a8342-ea7d-40c4-ab28-217a0342be10">
    <name>ИндивидуальныеДляНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="951a5403-e1a4-4484-8fda-c18df8f291d3">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57507687-e857-4627-84a6-131b6dc5555a">
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="898c017b-174f-4670-8146-5c6e75af51c1">
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d257be95-baab-4cf8-b5ae-541216c91b07">
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e654eb8f-cadf-4ea9-b106-6855158dcb94">
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="09a12ed1-441d-49a8-9f36-2093735e8d37">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad62bbb-21aa-4934-a430-a1bd6aa95383">
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3b86010-6dc9-4bd6-9fda-850ce2f2ea58">
  <name>ВидыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6673d95d-5505-48ac-867a-3145366a0bbd">
    <name>ИспользоватьСерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08523aaa-c465-4110-9eda-04a40e5d7dac">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/Documents/проф_ЗаказНаПеремещение/Forms/ФормаДокумента/Module.bsl
// ++ Проф-ИТ, #72, Соловьев А.А, 05.10.2023

#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; // используется механизмом обработки изменения реквизитов ТЧ

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++ Проф-ИТ, #379, Корнилов М.С., 07.12.2023
	Если Не проф_ОбщегоНазначенияВызовСервера.ЕстьРоль("проф_ИзменениеСтатусовСогласованияУЗаказаНаПеремещение") Тогда
		Если Объект.СтатусСогласованияЗаказа = Перечисления.торо_СтатусыУтвержденияЗаказовНаВП.проф_Новый Тогда
			Элементы.СтатусСогласованияЗаказа.ТолькоПросмотр = Истина;
		Иначе	
			ТолькоПросмотр = (Объект.СтатусСогласованияЗаказа = Перечисления.торо_СтатусыУтвержденияЗаказовНаВП.НаУтверждении) 
				Или (Объект.СтатусСогласованияЗаказа = Перечисления.торо_СтатусыУтвержденияЗаказовНаВП.Утвержден);
		КонецЕсли;
	КонецЕсли;
	//-- Проф-ИТ, #379, Корнилов М.С., 07.12.2023
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	ПодразделенияСлужбыТОИР = Справочники.проф_НастройкиСистемы.ПолучитьСпЗначНастройкиСистемы(
												"Подразделения", "ПодразделенияСлужбыТОИР");
	УстановитьУсловноеОформление();
	
	Элементы.Переместить(Элементы.Форматоро_Перейти, Элементы.ФормаКоманднаяПанель, Элементы.ФормаЗапроситьПеремещение);
	
	//++ Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	проф_ОбщегоНазначенияВызовСервера.УстановитьПараметрВыбораПодразделения(Элементы);
	//-- Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	
	//++ Проф-ИТ, #424, Соловьев А.А., 16.01.2024
	СтатусДоступностиОтмены = (Объект.СтатусСогласованияЗаказа = Перечисления.торо_СтатусыУтвержденияЗаказовНаВП.проф_Новый)
			Или (Объект.СтатусСогласованияЗаказа = Перечисления.торо_СтатусыУтвержденияЗаказовНаВП.Отклонен);
	
	Элементы.ТоварыОтменено.ТолькоПросмотр = Не СтатусДоступностиОтмены;
	Элементы.ТоварыПричинаОтмены.ТолькоПросмотр = Не СтатусДоступностиОтмены;
	//-- Проф-ИТ, #424, Соловьев А.А., 16.01.2024
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.торо_ПодборНоменклатуры.Форма.Форма" Тогда
		ДобавитьНоменклатуруИзПодбора(ВыбранноеЗначение); 
	КонецЕсли;
	
КонецПроцедуры

//++ Проф-ИТ, #349, Соловьев А.А., 15.11.2023
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не Отказ
		И Не ВопросЗадан
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ЗадатьВопросСкладСтатусСогласования(Объект.СкладОтправитель, Объект.СтатусСогласованияЗаказа) Тогда 
		
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемОбработчикОповещения", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Документ находится в статусе ""Новый"". Изменить на ""Утвержден""?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВопросЗадан = Ложь;
	КонецЕсли;
	
КонецПроцедуры
//-- Проф-ИТ, #349, Соловьев А.А., 15.11.2023
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//++ Проф-ИТ, #424, Соловьев А.А., 16.01.2024
&НаКлиенте
Процедура СтатусСогласованияЗаказаПриИзменении(Элемент)
	
	СтатусДоступностиОтмены = (Объект.СтатусСогласованияЗаказа = ПредопределенноеЗначение("Перечисление.торо_СтатусыУтвержденияЗаказовНаВП.проф_Новый"))
			Или (Объект.СтатусСогласованияЗаказа = ПредопределенноеЗначение("Перечисление.торо_СтатусыУтвержденияЗаказовНаВП.Отклонен"));
	
	Элементы.ТоварыОтменено.ТолькоПросмотр = Не СтатусДоступностиОтмены;
	Элементы.ТоварыПричинаОтмены.ТолькоПросмотр = Не СтатусДоступностиОтмены;
	
КонецПроцедуры
//-- Проф-ИТ, #424, Соловьев А.А., 16.01.2024

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезаполнитьНазначения(Команда)
	
	ЗаполнитьДоступностьНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоступность(Команда)

	 ЗаполнитьДоступностьНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Поле ""Склад отправитель"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Объект.СкладОтправитель");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Объект.СкладОтправитель);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки", Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены", Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры", Истина);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Подбор товаров'"));
	ПараметрыФормы.Вставить("ЗаголовокКнопкиЗапрашиватьКоличествоИЦену", НСтр("ru = 'Запрашивать количество'"));
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ПростойПодборНоменклатуры");
	ПараметрыФормы.Вставить("ВидимостьСерий", Истина);

	МассивТиповНоменклатуры = ПолучитьМассивТиповНоменклатуры();
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", МассивТиповНоменклатуры);
	
	ОткрытьФорму("Обработка.торо_ПодборНоменклатуры.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ПарамСтатьи = Новый Структура;
	ПарамСтатьи.Вставить("Организация", Объект.Организация);

	ПараметрыНоменклатураПриИзмененииПереопределяемый = Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
																		 ЭтаФорма.ИмяФормы, "Товары");

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый",
								 ПараметрыНоменклатураПриИзмененииПереопределяемый);

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ТекущаяСтрока.СерииИспользуются = ПолучитьСерииИспользуются(ТекущаяСтрока.Номенклатура);
	ТекущаяСтрока.Серия = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МассивТиповНоменклатуры = ПолучитьМассивТиповНоменклатуры();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(МассивТиповНоменклатуры)); 
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",
				 ПараметрыФормы, Элемент, , , , ,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	ПараметрыХарактеристикаПриИзмененииПереопределяемый = Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
																			 ЭтаФорма.ИмяФормы, "Товары");
	СтруктураДействий.Вставить("ХарактеристикаПриИзмененииПереопределяемый",
								 ПараметрыХарактеристикаПриИзмененииПереопределяемый);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаполнитьДанныеВыбораУпаковки(Элементы.Товары.ТекущиеДанные.Номенклатура, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные =  Элементы.Товары.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ВидНоменклатуры = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
											ТекДанные.Номенклатура, "ВидНоменклатуры");
		ПараметрыВидНоменклатуры = Новый Структура("ВидНоменклатуры", ВидНоменклатуры);
		ПараметрыФормы = Новый Структура("Отбор", ПараметрыВидНоменклатуры);
		ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание > 0 Тогда
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		ВидНоменклатуры = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
										ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ПараметрыПолученияДанных.Отбор.Вставить("ВидНоменклатуры", ВидНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ВидНоменклатуры = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
									ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
	ПараметрыПолученияДанных.Отбор.Вставить("ВидНоменклатуры", ВидНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
	И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ВидНоменклатуры = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
										ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ВидНоменклатурыВыбранный = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
															ВыбранноеЗначение, "ВидНоменклатуры");
		Если ВидНоменклатуры <> ВидНоменклатурыВыбранный Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаСоздание(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
	И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Вид = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		СтруктураПараметров = Новый Структура("ВидНоменклатуры, Владелец", Вид, Элементы.Товары.ТекущиеДанные.Номенклатура);
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаЭлемента", СтруктураПараметров);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияСоздание(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;

	Если ТекущиеДанные <> Неопределено
	И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекВидНоменклатуры = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
											ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		СтруктураПараметров = Новый Структура("ВидНоменклатуры", ТекВидНоменклатуры);
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаЭлемента", СтруктураПараметров);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаОкончаниеВводаТекста(Элемент,
												   Текст,
												   ДанныеВыбора,
												   ПараметрыПолученияДанных,
												   СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
										ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ИспользованиеХарактеристик = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
													ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение(
				"Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаАвтоПодбор(Элемент,
										 Текст,
										 ДанныеВыбора,
										 ПараметрыПолученияДанных,
										 Ожидание,
										 СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
										ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ИспользованиеХарактеристик = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(
													ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение(
				"Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

//++ Проф-ИТ, #424, Соловьев А.А., 16.01.2024
&НаКлиенте
Процедура ТоварыОтмененоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.проф_Отменил = ТекущиеДанныеОтменил(ТекущиеДанные.Отменено);
	
КонецПроцедуры
//-- Проф-ИТ, #424, Соловьев А.А., 16.01.2024

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

//++ Проф-ИТ, #370, Соловьев А.А., 28.11.2023
// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 
//-- Проф-ИТ, #370, Соловьев А.А., 28.11.2023

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСерииИспользуются(Знач Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	               |		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	               |ГДЕ
	               |	Номенклатура.Ссылка = &Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИспользоватьСерии;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивТиповНоменклатуры()
	
	МассивТиповНоменклатуры = Новый Массив();
	Для Каждого текСтрока Из Перечисления.ТипыНоменклатуры Цикл
		Если текСтрока = Перечисления.ТипыНоменклатуры.Услуга
		ИЛИ текСтрока = Перечисления.ТипыНоменклатуры.Работа Тогда
			Продолжить;
		КонецЕсли;
		МассивТиповНоменклатуры.Добавить(текСтрока);
	КонецЦикла;
	
	Возврат МассивТиповНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДанныеВыбораУпаковки(Номенклатура, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбораУпаковки = Новый Структура("Номенклатура", Номенклатура);
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДанныеВыбораУпаковкиСервер(ДанныеВыбора, ПараметрыВыбораУпаковки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеВыбораУпаковкиСервер(ДанныеВыбора, ПараметрыВыбора)

	ДанныеВыбора = Справочники.УпаковкиНоменклатуры.ПолучитьДанныеВыбора(ПараметрыВыбора);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	СтрЭлементОтбораКомпоновкиДанных = "ЭлементОтбораКомпоновкиДанных";
	СтрЦветТекста = "ЦветТекста";

	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНоменклатураЕдиницаИзмерения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип(СтрЭлементОтбораКомпоновкиДанных));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Упаковка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыХарактеристика.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип(СтрЭлементОтбораКомпоновкиДанных));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра(СтрЦветТекста, ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип(СтрЭлементОтбораКомпоновкиДанных));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Отменено");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра(СтрЦветТекста, ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	// Оформление поля Серия	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСерия.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип(СтрЭлементОтбораКомпоновкиДанных));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СерииИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра(СтрЦветТекста, WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<серии не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий)
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыПоНоменклатуре()
	
	СтрНоменклатура = "Номенклатура";
	
	ПараметрыЗаполнитьПризнакХарактеристикиИспользуются = Новый Структура(СтрНоменклатура, "ХарактеристикиИспользуются");	
	ПараметрыЗаполнитьПризнакТипНоменклатуры = Новый Структура(СтрНоменклатура, "ТипНоменклатуры");
	ПараметрыЗаполнитьПризнакАртикул = Новый Структура(СтрНоменклатура, "Артикул");
	ПараметрыЗаполнитьПризнакСерииИспользуются = Новый Структура(СтрНоменклатура, "СерииИспользуются");
	
	СтруктураДействий = Новый Структура;                                  	
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
								 ПараметрыЗаполнитьПризнакХарактеристикиИспользуются);	
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ПараметрыЗаполнитьПризнакТипНоменклатуры);	
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", ПараметрыЗаполнитьПризнакАртикул);	
	СтруктураДействий.Вставить("ЗаполнитьПризнакСерииИспользуются", ПараметрыЗаполнитьПризнакСерииИспользуются);
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, СтруктураДействий);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступностьНаСервере(ПоОтклоненным)

	Если Не ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда 
		ТекстСообщения = НСтр("ru = 'Поле ""Склад-отправитель"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.СкладОтправитель");
	Иначе
		Документы.проф_ЗаказНаПеремещение.ПерезаполнитьДоступностьИНазначения(Объект.Товары, ПоОтклоненным, 
			Объект.СкладОтправитель, Объект.Дата, ПодразделенияСлужбыТОИР);
		Модифицированность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьПеремещение(Команда)
	
	Оповещение = Новый ОписаниеОповещения("РезультатИзДругойФормы", ЭтотОбъект);	
	АдресТовары = ПоместитьТоварыВХранилище();
	ПараметрыФормы = Новый Структура("АдресТовары", АдресТовары);
	ОткрытьФорму("Обработка.проф_ЗапроситьПеремещениеУДругогоПодразделения.Форма.Форма",
		ПараметрыФормы, ЭтотОбъект, , , , Оповещение);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТоварыВХранилище()
	
	ТаблицаТовары = Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура, Характеристика, Количество");
	ТаблицаТовары.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникССылка.Склады"));
	ТаблицаТовары.Очистить();
	Для Каждого ТекСтрока Из Объект.Товары Цикл  
		Если ТекСтрока.СогласованиеКорректировки = Перечисления.проф_СогласованиеКорректировки.Отклонен
			ИЛИ ТекСтрока.СогласованиеКорректировки = Перечисления.проф_СогласованиеКорректировки.Ошибка	
			ИЛИ Не ЗначениеЗаполнено(ТекСтрока.СогласованиеКорректировки) Тогда
			
			новСтрока = ТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(новСтрока, ТекСтрока); 
			новСтрока.Склад       = Объект.СкладОтправитель; 
			
		КонецЕсли;
	КонецЦикла;    
	
	СтруктураТовары = Новый Структура("ТаблицаТовары, ДокументДляСогласования", ТаблицаТовары, Объект.Ссылка);
	Возврат ПоместитьВоВременноеХранилище(СтруктураТовары, Новый УникальныйИдентификатор);

КонецФункции

&НаКлиенте
Процедура РезультатИзДругойФормы(Результат, Параметры) Экспорт 
	
	Если НЕ Результат = Неопределено Тогда
		
		//ЗаполнитьИОтправитьНаСогласование(Результат);
		
		ЗаполнитьНазначенияИзОбработки(Результат);
		//ОтправитьНаСогласованиеНаСервере();
		Записать();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИОтправитьНаСогласование(Результат)
	
	НачатьТранзакцию();
	Попытка
		ЗаполнитьНазначенияИзОбработки(Результат);
		ОтправитьНаСогласованиеНаСервере();
		ЗафиксироватьТранзакцию();
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		//ВызватьИсключение;
	КонецПопытки;	
	
КонецПроцедуры

&НаСервере 
Процедура ДобавитьНоменклатуруИзПодбора(Адрес)
	
	ТаблицаПодбора = ПолучитьИзВременногоХранилища(Адрес);
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий);
	
	Для Каждого ТекущаяСтрока Из ТаблицаПодбора Цикл
		
		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, Серия", 
			ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Характеристика, ТекущаяСтрока.Серия);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок;
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.КоличествоУпаковок + ТекущаяСтрока.КоличествоУпаковок;
			НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок;
		КонецЕсли;
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
		
	КонецЦикла;
	
	Если ТаблицаПодбора.Количество() > 0 Тогда 
		ЗаполнитьДоступностьНаСервере(Ложь);
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере 
Процедура ЗаполнитьНазначенияИзОбработки(Адрес)
	
	Если Адрес = Неопределено Тогда  
		Возврат;
	КонецЕсли;  
	
	СтруктураТовары = ПолучитьИзВременногоХранилища(Адрес);
	Товары.Загрузить(СтруктураТовары.Товары); 
	
	ТекДата = ТекущаяДата(); 
	
	
	
	Для каждого текСтрока Из Объект.Товары Цикл 
		КолИсходное                  = текСтрока.Количество;
		ДоступноИсходное             = текСтрока.Доступно; 
		СогласованиеКорректировкиИсх = текСтрока.СогласованиеКорректировки;
		СтруктураПоиска = Новый Структура("НомерСтрокиИсточника", текСтрока.НомерСтроки);
		
		НайденныеСтроки = Товары.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;	
		КонецЕсли;     
		
		КолПодбора = 0; 
		Итерация = 1;
		Для каждого текСтрокаПодбора Из НайденныеСтроки Цикл
			Если текСтрокаПодбора.Количество = 0 Тогда
				Продолжить;		
			КонецЕсли;
			
			Если Итерация = 1 Тогда
				текСтрока.Количество         = текСтрокаПодбора.Количество; 
				текСтрока.КоличествоУпаковок = текСтрокаПодбора.Количество;
				текСтрока.НазначениеИсходное = текСтрокаПодбора.Назначение;
				текСтрока.Доступно           = текСтрокаПодбора.Количество;
				текСтрока.СогласованиеКорректировки = Перечисления.проф_СогласованиеКорректировки.ОбменСERP;
			Иначе
				новСтрока = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(новСтрока, текСтрока, , "КодСтроки");
				
				новСтрока.Количество         = текСтрокаПодбора.Количество;
				новСтрока.КоличествоУпаковок = текСтрокаПодбора.Количество;
				новСтрока.НазначениеИсходное = текСтрокаПодбора.Назначение;
				новСтрока.Доступно           = текСтрокаПодбора.Количество;
				новСтрока.СогласованиеКорректировки = Перечисления.проф_СогласованиеКорректировки.ОбменСERP;
			КонецЕсли;
			
			ЕДИзм = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текСтрокаПодбора.Номенклатура, "ЕдиницаИзмерения"); 
			ТекстКомментария = НСтр("ru = '""Снятие резерва по %1, %2 %3, %4, %5.""'");
			ТекстКомментария = СтрШаблон(ТекстКомментария, текСтрокаПодбора.Номенклатура, текСтрокаПодбора.Количество,
			                             ЕДИзм, текСтрокаПодбора.Назначение, ТекДата);
			Объект.Комментарий = Объект.Комментарий + Символы.ПС + ТекстКомментария; 
			
			КолИсходное = КолИсходное - текСтрокаПодбора.Количество;
			КолПодбора  = КолПодбора + текСтрокаПодбора.Количество;  
			Итерация = Итерация + 1; 
			Модифицированность = Истина;
		КонецЦикла;
		
		Если КолИсходное > 0 
			И КолПодбора > 0 Тогда 
			новСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(новСтрока, текСтрока, , "КодСтроки");
			
			новСтрока.Количество         = КолИсходное; 
			новСтрока.КоличествоУпаковок = КолИсходное;
			новСтрока.НазначениеИсходное = Неопределено;
			новСтрока.Доступно           = 0; 
			//новСтрока.СогласованиеКорректировки = СогласованиеКорректировкиИсх;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласование()  
	
	ПолучитьТаблицуОстаков();
	
	НаименованиеШаблона = "Согласование изменения заказа";
	
	ЕстьОшибки = Ложь;
	
	Если НЕ ЕстьОшибки Тогда
		СтрокиИтог = ДеревоТовары.ПолучитьЭлементы();
		Для каждого СтрИтог Из СтрокиИтог Цикл
			
			СтрокиОстаткиНом = СтрИтог.ПолучитьЭлементы();
			Для каждого СтрОстаткиНом Из СтрокиОстаткиНом Цикл
				
				Если СтрОстаткиНом.Количество = 0 Тогда
					Продолжить;
				КонецЕсли; 
				
				СтрокиОстаткиПодр = СтрОстаткиНом.ПолучитьЭлементы();
				Для каждого СтрОстаткиПодр Из СтрокиОстаткиПодр Цикл
					ТекстОписанияИтог = "";
					
					СтрокиИДЗаказа = СтрОстаткиПодр.ПолучитьЭлементы();
					Для каждого СтрИДЗаказа Из СтрокиИДЗаказа Цикл
						
						
						СтрокиОстатки = СтрИДЗаказа.ПолучитьЭлементы();
						Для каждого СтрОстатки Из СтрокиОстатки Цикл
							
							
							ТекстОписания = Нстр("ru = 'Согласовать снятие резерва: %1 - %2 - %3 %4 для назначения: %5'");
							ТекЕИ = ПолучитьЕдиницуИзмерения(СтрОстатки.Номенклатура);
							ТекстОписания = СтрШаблон(ТекстОписания, Символы.ПС, СтрОстатки.Номенклатура, СтрОстатки.Количество, ТекЕИ, СтрОстатки.Назначение);
							
							ТекстОписанияИтог = ?(ТекстОписанияИтог = "", ТекстОписания, ТекстОписанияИтог + Символы.ПС + ТекстОписания);
						КонецЦикла;
						
						ПредметID = "";
						Если ЗначениеЗаполнено(СтрИДЗаказа.ИДЗаказа) Тогда			
							//ПредметID = Строка(ДокументДляСогласования.УникальныйИдентификатор());
							ПредметID = СтрИДЗаказа.ИДЗаказа;
						КонецЕсли;
						
						ПараметрыФормы = Новый Структура;
						
						ПредметБизнесПроцесса = Новый Структура;
						ПредметБизнесПроцесса.Вставить("ID", ПредметID); //ПредметID
						ПредметБизнесПроцесса.Вставить("type", "DMInternalDocument");     
						
						name = ПолучитьОписаниеПредметаСогласования(Объект.Ссылка);
						
						ПредметБизнесПроцесса.Вставить("name", name); 
						
						Если ЗначениеЗаполнено(ПредметID) Тогда
							ПараметрыФормы.Вставить("Предмет", ПредметБизнесПроцесса);
						КонецЕсли;  
						
						ПараметрыФормы.Вставить("Описание", ТекстОписанияИтог);
						
						ШаблонБизнесПроцесса = Новый Структура;
						ШаблонБизнесПроцесса.Вставить("ID", "32fccb2e-ac94-11ed-bca8-3cecef0dcbf1");
						ШаблонБизнесПроцесса.Вставить("type", "DMBusinessProcessApprovalTemplate");
						ПараметрыФормы.Вставить("Шаблон", ШаблонБизнесПроцесса);
						
						ТипПроцесса = "DMBusinessProcessApproval"; 
						
						ПараметрыОтбора = Новый Структура("Номенклатура, НазначениеИсходное", СтрОстатки.Номенклатура, СтрОстатки.Назначение); 
						НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
						
						Попытка
							Если ЗаполнитьСтартоватьПроцесс(ТипПроцесса, ПараметрыФормы) Тогда
								
								ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Стартован бизнес-процесс по шаблону ""%1"".';
								|en = 'Business process started by template ""%1"".'"), НаименованиеШаблона);
								ТекстЗаголовка = НСтр("ru = 'Стартован процесс';
								|en = 'Process is started'");
								ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
								
								ПараметрыОповещения = Новый Структура;
								ПараметрыОповещения.Вставить("ID", ПроцессID);
								ПараметрыОповещения.Вставить("Стартован", Истина);
								
								// Соберем предметы.
								Предметы = Новый Массив;;
								Предметы.Добавить(ПредметБизнесПроцесса);
								
								ПараметрыОповещения.Вставить("Предметы", Предметы);
								
								Оповестить("Запись_ДокументооборотБизнесПроцесс", ПараметрыОповещения, ВладелецФормы);  
								Для каждого текСтрока Из НайденныеСтроки Цикл
									текСтрока.СогласованиеКорректировки = ПредопределенноеЗначение("Перечисление.проф_СогласованиеКорректировки.НаСогласовании");
								КонецЦикла
							Иначе
								ИнтеграцияС1СДокументооборотКлиент.ОткрытьОбъект(ТипПроцесса, Неопределено, , ПараметрыФормы);
							КонецЕсли; 
						Исключение 
							ПричинаОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
							ТекстОшибки = Нстр("ru = 'Задание по снятию резерва по %1, %2, %3, %4 в ДО не сформировано! Причина: %5%6'");
							ТекстОшибки = СтрШаблон(ТекстОшибки, СтрОстатки.Номенклатура, СтрОстатки.Количество, ТекЕИ, СтрОстатки.Назначение, Символы.ПС, ПричинаОшибки);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения); 
							Для каждого текСтрока Из НайденныеСтроки Цикл
								текСтрока.СогласованиеКорректировки = ПредопределенноеЗначение("Перечисление.проф_СогласованиеКорректировки.Ошибка");
							КонецЦикла
						КонецПопытки;
						
					КонецЦикла;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСогласованиеНаСервере()  
	
	ПолучитьТаблицуОстаков();
	
	НаименованиеШаблона = "Согласование изменения заказа";
	
	ЕстьОшибки = Ложь;
	
	Если НЕ ЕстьОшибки Тогда
		СтрокиИтог = ДеревоТовары.ПолучитьЭлементы();
		Для каждого СтрИтог Из СтрокиИтог Цикл
			
			СтрокиОстаткиНом = СтрИтог.ПолучитьЭлементы();
			Для каждого СтрОстаткиНом Из СтрокиОстаткиНом Цикл
				
				Если СтрОстаткиНом.Количество = 0 Тогда
					Продолжить;
				КонецЕсли; 
				
				СтрокиОстаткиПодр = СтрОстаткиНом.ПолучитьЭлементы();
				Для каждого СтрОстаткиПодр Из СтрокиОстаткиПодр Цикл
					ТекстОписанияИтог = "";
					
					СтрокиИДЗаказа = СтрОстаткиПодр.ПолучитьЭлементы();
					Для каждого СтрИДЗаказа Из СтрокиИДЗаказа Цикл
						
						
						СтрокиОстатки = СтрИДЗаказа.ПолучитьЭлементы();
						Для каждого СтрОстатки Из СтрокиОстатки Цикл
							
							
							ТекстОписания = Нстр("ru = 'Согласовать снятие резерва: %1 - %2 - %3 %4 для назначения: %5'");
							ТекЕИ = ПолучитьЕдиницуИзмерения(СтрОстатки.Номенклатура);
							ТекстОписания = СтрШаблон(ТекстОписания, Символы.ПС, СтрОстатки.Номенклатура, СтрОстатки.Количество, ТекЕИ, СтрОстатки.Назначение);
							
							ТекстОписанияИтог = ?(ТекстОписанияИтог = "", ТекстОписания, ТекстОписанияИтог + Символы.ПС + ТекстОписания);
						КонецЦикла;
						
						ПредметID = "";
						Если ЗначениеЗаполнено(СтрИДЗаказа.ИДЗаказа) Тогда			
							//ПредметID = Строка(ДокументДляСогласования.УникальныйИдентификатор());
							ПредметID = СтрИДЗаказа.ИДЗаказа;
						КонецЕсли;
						
						ПараметрыФормы = Новый Структура;
						
						ПредметБизнесПроцесса = Новый Структура;
						ПредметБизнесПроцесса.Вставить("ID", ПредметID); //ПредметID
						ПредметБизнесПроцесса.Вставить("type", "DMInternalDocument");     
						
						name = ПолучитьОписаниеПредметаСогласования(Объект.Ссылка);
						
						ПредметБизнесПроцесса.Вставить("name", name); 
						
						Если ЗначениеЗаполнено(ПредметID) Тогда
							ПараметрыФормы.Вставить("Предмет", ПредметБизнесПроцесса);
						КонецЕсли;  
						
						ПараметрыФормы.Вставить("Описание", ТекстОписанияИтог);
						
						ШаблонБизнесПроцесса = Новый Структура;
						ШаблонБизнесПроцесса.Вставить("ID", "32fccb2e-ac94-11ed-bca8-3cecef0dcbf1");
						ШаблонБизнесПроцесса.Вставить("type", "DMBusinessProcessApprovalTemplate");
						ПараметрыФормы.Вставить("Шаблон", ШаблонБизнесПроцесса);
						
						ТипПроцесса = "DMBusinessProcessApproval"; 
						
						ПараметрыОтбора = Новый Структура("Номенклатура, НазначениеИсходное", СтрОстатки.Номенклатура, СтрОстатки.Назначение); 
						НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
						
						Попытка
							Если ЗаполнитьСтартоватьПроцесс(ТипПроцесса, ПараметрыФормы) Тогда
								
								ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Стартован бизнес-процесс по шаблону ""%1"".';
								|en = 'Business process started by template ""%1"".'"), НаименованиеШаблона);
								ТекстЗаголовка = НСтр("ru = 'Стартован процесс';
								|en = 'Process is started'");
								//ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
								
								ПараметрыОповещения = Новый Структура;
								ПараметрыОповещения.Вставить("ID", ПроцессID);
								ПараметрыОповещения.Вставить("Стартован", Истина);
								
								// Соберем предметы.
								Предметы = Новый Массив;;
								Предметы.Добавить(ПредметБизнесПроцесса);
								
								ПараметрыОповещения.Вставить("Предметы", Предметы);
								
								//Оповестить("Запись_ДокументооборотБизнесПроцесс", ПараметрыОповещения, ВладелецФормы);  
								Для каждого текСтрока Из НайденныеСтроки Цикл
									текСтрока.СогласованиеКорректировки = Перечисления.проф_СогласованиеКорректировки.НаСогласовании;
								КонецЦикла
							Иначе
								//ИнтеграцияС1СДокументооборотКлиент.ОткрытьОбъект(ТипПроцесса, Неопределено, , ПараметрыФормы);
							КонецЕсли; 
						Исключение 
							ПричинаОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
							ТекстОшибки = Нстр("ru = 'Задание по снятию резерва по %1, %2, %3, %4 в ДО не сформировано! Причина: %5%6'");
							ТекстОшибки = СтрШаблон(ТекстОшибки, СтрОстатки.Номенклатура, СтрОстатки.Количество, ТекЕИ, СтрОстатки.Назначение, Символы.ПС, ПричинаОшибки);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки); 
							Для каждого текСтрока Из НайденныеСтроки Цикл
								текСтрока.СогласованиеКорректировки = Перечисления.проф_СогласованиеКорректировки.Ошибка;
							КонецЦикла
						КонецПопытки;
						
					КонецЦикла;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТаблицуОстаков() 
	
	мсвГруппировкиКолонок = Новый Массив;
	мсвГруппировкиКолонок.Добавить("Подразделение");
	мсвГруппировкиКолонок.Добавить("Номенклатура");
	мсвГруппировкиКолонок.Добавить("ИДЗаказа");
	
	текДеревоОстатки = ТаблицаЗначенийВДеревоЗначений(Товары.Выгрузить(), мсвГруппировкиКолонок);
	
	ЗначениеВРеквизитФормы(текДеревоОстатки, "ДеревоТовары");
	
КонецПроцедуры // ПолучитьТаблицуОстаков()

&НаСервере
Функция ТаблицаЗначенийВДеревоЗначений(ТаблЗначений, мсвГруппировкиКолонок)
	
	ПострЗапроса             		= Новый ПостроительЗапроса;
	ПострЗапроса.ИсточникДанных             = Новый ОписаниеИсточникаДанных(ТаблЗначений);
	
	ПострЗапроса.ДобавлениеПредставлений 	= ТипДобавленияПредставлений.НеДобавлять; 
	Для каждого текЭлемент Из мсвГруппировкиКолонок Цикл
	    ПострЗапроса.ИсточникДанных.Колонки[текЭлемент].Измерение = Истина;
	КонецЦикла;  
	
	ПострЗапроса.ИсточникДанных.Колонки["Количество"].Итог = "Сумма(Количество)";
	
	ПострЗапроса.ЗаполнитьНастройки();
	ПострЗапроса.Выполнить();
	
	ДеревоЗн = ПострЗапроса.Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Возврат ДеревоЗн;

КонецФункции

&НаСервере
Функция ПолучитьЕдиницуИзмерения(Номенклатура)
	
	ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
		
	КонецЕсли;
	
	Возврат ЕдиницаИзмерения;
	
КонецФункции

&НаСервере
Функция ПолучитьОписаниеПредметаСогласования(ДокументДляСогласования)
	
	Если ЗначениеЗаполнено(ДокументДляСогласования) Тогда		
		возврат "Заказ на ВПТ "+ДокументДляСогласования.Номер + " от "+ДокументДляСогласования.Дата+"/"+ДокументДляСогласования.Подразделение;
	иначе		
		возврат "";		
	КонецЕсли; 
	
	////"Заказ на ВПТ  
КонецФункции

 &НаСервере
Функция ЗаполнитьСтартоватьПроцесс(ТипПроцесса, ПараметрыЗапуска)
	
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	
	Если ПараметрыЗапуска.Свойство("Предмет") Тогда
		ШаблонПроцесса = ИнтеграцияС1СДокументооборот.НовыйБизнесПроцессПоШаблону(Прокси, ТипПроцесса, ПараметрыЗапуска.Шаблон, ПараметрыЗапуска.Предмет);
	Иначе
		ШаблонПроцесса = ИнтеграцияС1СДокументооборот.НовыйБизнесПроцессПоШаблону(Прокси, ТипПроцесса, ПараметрыЗапуска.Шаблон);
	КонецЕсли;
	ШаблонПроцесса.description = ПараметрыЗапуска.Описание;   
	
	НовыйПроцесс = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, ШаблонПроцесса.ObjectID.type);
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьЗначенияСвойствXDTO(Прокси, НовыйПроцесс, ШаблонПроцесса);
	
	РезультатЗапуска = ИнтеграцияС1СДокументооборот.ЗапуститьБизнесПроцесс(Прокси, НовыйПроцесс);
		
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, РезультатЗапуска, "DMError") Тогда
		Возврат Ложь;
	Иначе
		ПроцессID = РезультатЗапуска.businessProcess.ObjectID.ID;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

//++ Проф-ИТ, #349, Соловьев А.А., 15.11.2023
&НаСервереБезКонтекста
Функция ЗадатьВопросСкладСтатусСогласования(СкладОтправитель, СтатусСогласованияЗаказа)
	
	ЦентральныйСкладБилибино = Справочники.проф_НастройкиСистемы.ПолучитьНастройкуСистемы("НастройкиОбменаТОИР", 
		"ЦентральныйСкладБилибино");
	
	Возврат СкладОтправитель = ЦентральныйСкладБилибино
		И СтатусСогласованияЗаказа = Перечисления.торо_СтатусыУтвержденияЗаказовНаВП.проф_Новый;
	
КонецФункции
	
&НаКлиенте
Процедура ПередЗакрытиемОбработчикОповещения(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Объект.СтатусСогласованияЗаказа = ПредопределенноеЗначение("Перечисление.торо_СтатусыУтвержденияЗаказовНаВП.Утвержден");
		ВопросЗадан = Истина;
		Записать();
		
	КонецЕсли;
	
КонецПроцедуры
//-- Проф-ИТ, #349, Соловьев А.А., 15.11.2023

//++ Проф-ИТ, #424, Соловьев А.А., 16.01.2024
&НаСервереБезКонтекста
Функция ТекущиеДанныеОтменил(Отменено)
	
	Возврат ?(Отменено, ПараметрыСеанса.ТекущийПользователь, Справочники.Пользователи.ПустаяСсылка());
	
КонецФункции
//-- Проф-ИТ, #424, Соловьев А.А., 16.01.2024

#КонецОбласти

// -- Проф-ИТ, #72, Соловьев А.А, 05.10.2023
